---
kind: enumMember
id: F:Autodesk.Revit.DB.OrdinateTextOrientation.ParallelToWitnessLine
enum: Autodesk.Revit.DB.OrdinateTextOrientation
source: html/e8631cb4-24fc-71e8-3916-55dd5aa8ebf3.htm
---
# Autodesk.Revit.DB.OrdinateTextOrientation.ParallelToWitnessLine

The dimension text orientation will be parallel to witness line.